{"6787":{"post":{"post_status":"publish","comment_status":"closed","post_date":"2020-06-04 14:38:00","post_date_gmt":"2020-06-04 18:38:00","post_content":"","post_title":"Stories","post_excerpt":"","post_type":"post","post_name":"stories","post_modified":"2020-10-29 10:33:00","post_modified_gmt":"2020-10-29 14:33:00","post_parent":0,"menu_order":9,"meta_input":[],"tags":["Picture Story","Frontline"]}},"6875":{"media":{"featuredImage":{"file":"https:\/\/gm.adventistmission.org\/assets\/public\/gm\/picture-story\/2020\/v20n3\/01-head.jpg","desc":""}},"post":{"post_status":"publish","comment_status":"closed","post_date":"2020-08-10 16:29:00","post_date_gmt":"2020-08-10 20:29:00","post_content":"<p><span class=\"cap\">M<\/span>y husband and I are Global Mission pioneers sharing the love of Jesus in a veiled country*. We’ve got to be so careful when we share our faith. But this isn’t stopping the spread of the gospel. Many people here want to learn more about Jesus.\r\n<\/p><p>One day we visited a couple who were struggling with their faith. My mom had started to show an interest in God, so we decided to take her with us. We all had a wonderful time together studying the Word of God.\r\n<\/p><p>To our delight the couple began visiting our Urban Center of Influence (UCI) for massage therapy, healthy meals, and Bible studies. My mom came to the Bible studies too. It was wonderful to see the three of them grow in their faith in God. They started attending worship services at our secret church plant.\r\n<\/p><p>Not long after, the couple and my mom were baptized. What a joy to see them give their hearts to Jesus! Please pray for my husband and me and other Global Mission pioneers in veiled countries as we share the love of Jesus with our family, friends, and community.\r\n<\/p><p>*We’ve removed identifying information and images to protect the Global Mission pioneers and their community in this “Veiled Country,” so that the work can move forward for the glory of God.\r\n<\/p>","post_title":"The Gospel Spreads Under the Veil","post_excerpt":" We’ve got to be so careful when we share our faith. But this isn’t stopping the spread of the gospel. Many people here want to learn more about Jesus.","post_type":"post","post_name":"ps-v20n3-veiled-country","post_modified":"2020-08-10 17:58:00","post_modified_gmt":"2020-08-10 21:58:00","post_parent":6787,"menu_order":36,"meta_input":{"_featured_image_hero_layout":"hero_layout_1_3","_display_title":"The Gospel Spreads Under the Veil","_kicker":"","_long_header_subtitle":" We’ve got to be so careful when we share our faith. But this isn’t stopping the spread of the gospel. Many people here want to learn more about Jesus.","_hero_type":"default","_hero_title":"The Gospel Spreads Under the Veil","_hero_kicker":""},"tags":[""]}},"6911":{"post":{"post_status":"publish","comment_status":"closed","post_date":"2020-09-24 16:53:00","post_date_gmt":"2020-09-24 20:53:00","post_content":"<p>Yulian could barely feed himself from\r\nthe money he earned shining shoes. He\r\nset up every day along a busy walking\r\nstreet in Nicosia, Cyprus. Most of his money\r\nwent to buy cigarettes and alcohol. A decade\r\nearlier, Yulian had immigrated to southern\r\nCyprus from Bulgaria to look for a job.\r\n<\/p><p>One day, Filip, a Global Mission pioneer\r\nalso from Bulgaria, walked by and greeted\r\nYulian, asking if he needed any help.\r\n<\/p><p>Yulian was surprised. No one had asked\r\nhim such a question in a long time. It was\r\nnice to hear someone taking an interest in\r\nhim and speaking his native language, but\r\nYulian didn’t answer the question and just\r\noffered him a shoe shine.\r\n<\/p><p>While Yulian shined his shoes, Filip told\r\nhim that Jesus loves each one of us no matter\r\nwhat situation we’re in. The mention of Jesus\r\ngrabbed Yulian’s attention.\r\n<\/p><p class=\"p3\">[[$gallery]]<\/p><p>The next day, Filip returned and asked\r\nagain if Yulian needed any help. Yulian was\r\nsurprised the stranger had returned. This\r\ntime Filip didn’t need a shoe shine, so they \r\n\t<span class=\"redactor-invisible-space\">just talked for a while and looked through\r\nthe books that he brought. This became a\r\nroutine. \r\n\t<\/span>\r\n<\/p><p><span class=\"redactor-invisible-space\">Sometimes Filip read the Bible to Yulian,\r\nand eventually, the shoe shiner opened up\r\nabout how he’d worked in construction after\r\narriving with his family in Cyprus. He lost his\r\njob and was kicked out of his home for drinking. His family and friends had rejected him. \r\n\t<\/span>\r\n<\/p><p><span class=\"redactor-invisible-space\">One day, Yulian led his new friend to the\r\nabandoned building where he slept. His bed\r\nwas a hard floor. The sight brought tears to\r\nFilip’s eyes, and they prayed together on the\r\nstreet. \r\n\t<\/span>\r\n<\/p><p><span class=\"redactor-invisible-space\">Yulian felt valued and felt God’s love\r\nthrough the pioneer’s actions. It was at that\r\npoint that he gave his life to God. \r\n\t<\/span>\r\n<\/p><p><span class=\"redactor-invisible-space\">Although he’d drunk heavily for 35 years,\r\nYulian decided to give up alcohol that day.\r\nAnd although he had smoked heavily as well,\r\nhe quit a week later. His family welcomed him \r\n\t<span class=\"redactor-invisible-space\">back home, and now he tells everyone\r\nwho will listen about his love for God. \r\n\t<\/span><\/span>\r\n<\/p><p><span class=\"redactor-invisible-space\"><span class=\"redactor-invisible-space\">Filip regularly leads a Bulgarian-language Bible study. Over three years,\r\neight people were baptized through\r\nFilip’s work, a significant number for a\r\ncountry where the Adventist Church has\r\nonly about 100 members in a population of more than one million. He often\r\nspends his time mingling with people,\r\ngetting to know them where they are. \r\n\t<\/span><\/span>\r\n<\/p><p><span class=\"redactor-invisible-space\"><span class=\"redactor-invisible-space\">Please pray for pioneers like Filip,\r\nwho are sharing a message of hope\r\nwith their communities. And thank you\r\nfor supporting Global Mission!\r\n\t<\/span><\/span>\r\n<\/p>","post_title":"Befriending a Shoe Shiner","post_excerpt":"Yulian could barely feed himself from the money he earned shining shoes. His life was transformed when he met Filip, a Global Mission pioneer.","post_type":"post","post_name":"befriending-a-shoeshiner","post_modified":"2020-10-29 10:22:32","post_modified_gmt":"2020-10-29 14:22:32","post_parent":6787,"menu_order":35,"meta_input":[],"tags":["Global Mission","Global Mission pioneers","Trans-European Division","Frontline"]}},"6921":{"media":{"featuredImage":{"file":"https:\/\/gm.adventistmission.org\/assets\/public\/gm\/picture-story\/2020\/v20n4\/ps20q4-1-banner.jpg","desc":""}},"post":{"post_status":"publish","comment_status":"closed","post_date":"2020-10-29 11:17:00","post_date_gmt":"2020-10-29 15:17:00","post_content":"<p>The baby was constantly crying! He just wouldn’t stop, and his mother had no idea what to do!\r\n<\/p><p>At eight months old, the baby had open heart surgery. Afterward, he was in the hospital for weeks taking strong medicines. The baby had to be weaned off these drugs, and the withdrawals made him miserable.\r\n<\/p><p>I’m a nurse serving as a tentmaker in a veiled country, and I was assigned to take care of this baby. I had a good relationship with the mom, so I asked her if I could help calm her baby. She said I could try. So I took her phone and played some peaceful hymns and worship songs. After a few minutes, I checked on the two, and they were both fast asleep.\r\n<\/p><p>That was the only day I worked with the mom and her baby because my patients change every day. Two weeks later, I was delighted when I ran into them in the hall. She told me, “Look at my son. He’s so peaceful now. I've been playing the songs you shared with me. Thank you so much.\"\r\n<\/p><p>All I could say was “Praise God!” And then I hugged her.\r\n<\/p><hr><p><em>We’ve removed identifying information and images to protect this tentmaker and her community in this “veiled country,” so that the work can move forward for the glory of God. A tentmaker is an Adventist professional who uses his or her job to mingle with people and to share Jesus with the unreached. Learn more at <a href=\"https:\/\/bit.ly\/2HdgfZT\" target=\"_blank\">bit.ly\/2HdgfZT<\/a>.<\/em>\r\n<\/p>","post_title":"The Baby Wouldn’t Stop Crying","post_excerpt":"​The baby was constantly crying! He just wouldn’t stop, and his mother had no idea what to do!","post_type":"post","post_name":"baby-stop-crying","post_modified":"2020-10-29 11:53:41","post_modified_gmt":"2020-10-29 15:53:41","post_parent":6787,"menu_order":34,"meta_input":{"_featured_image_hero_layout":"hero_layout_1_3","_display_title":"The Baby Wouldn’t Stop Crying","_kicker":"","_long_header_subtitle":"​The baby was constantly crying! He just wouldn’t stop, and his mother had no idea what to do!","_hero_type":"default","_hero_title":"The Baby Wouldn’t Stop Crying","_hero_kicker":""},"tags":["Global Mission","Picture Story","Medical Missionary","Missionary"]}},"6922":{"media":{"featuredImage":{"file":"https:\/\/gm.adventistmission.org\/assets\/public\/gm\/picture-story\/2020\/v20n4\/ps20q4-2-banner2.jpg","desc":""}},"post":{"post_status":"publish","comment_status":"closed","post_date":"2020-10-29 11:17:00","post_date_gmt":"2020-10-29 15:17:00","post_content":"<p>What do plant-based cooking classes have to do with church planting? Camila is an excellent plant-based chef with a passion for her local community in Newcastle, Australia. She uses social media to advertise her plant-based cooking classes. At one of these gatherings, she and her husband, Joseph, met Lila* and they became friends.<br><\/p><div><p>After a few months, Lila shared that she felt disconnected from God. She wanted to start investing in her relationship with Jesus and actively following Him. She began studying the Bible with Camila and another friend. And this is how plant-based cooking classes are linked with church planting! Today, Lila is a member of the SEEDS church plant that Joseph leads.<\/p><p>Connecting with the community through plant-based cooking has been so rewarding for Camila and Joseph. “We’ve been able to attract talented and like-minded people to support our mission and be part of this movement, especially PhD students from the local university and young professionals and entrepreneurs seeking a fulfilling life,” says Camila.<\/p><p>Join us in praying for church planters like Camila and Joseph around the world who are sharing the love of Jesus in practical ways, like plantbased cooking classes.<\/p><p>*Name has been changed.<\/p><\/div>","post_title":"A Plant-Based Chef with a Mission","post_excerpt":"What do plant-based cooking classes have to do with church planting? ","post_type":"post","post_name":"plant-based-chef","post_modified":"2020-10-29 11:52:44","post_modified_gmt":"2020-10-29 15:52:44","post_parent":6787,"menu_order":33,"meta_input":{"_featured_image_hero_layout":"hero_layout_1_3","_display_title":"A Plant-Based Chef with a Mission","_kicker":"","_long_header_subtitle":"What do plant-based cooking classes have to do with church planting? ","_hero_type":"default","_hero_title":"A Plant-Based Chef with a Mission","_hero_kicker":""},"tags":["Global Mission","Picture Story","Missionary","South Pacific Division"]}},"6923":{"media":{"featuredImage":{"file":"https:\/\/gm.adventistmission.org\/assets\/public\/gm\/picture-story\/2020\/v20n4\/ps20q4-3-banner.jpg","desc":""}},"post":{"post_status":"publish","comment_status":"closed","post_date":"2020-10-29 11:17:00","post_date_gmt":"2020-10-29 15:17:00","post_content":"<p>When I found out that I’d be a Waldensian student in a veiled country, I prayed for my future classmates.<\/p><p>On the first day of school, I made a friend named Mariam.* As time passed, Mariam became my closest friend at the university. She even said that I was like a sister to her. One weekend, Mariam invited me to her house. Little did I know that I was about to experience an incredible miracle.<\/p><p>For four days, I became a part of Mariam’s family. One night, Mariam and I were in her room, and we had a wonderful conversation about faith. “Mariam, would you like to read these stories in your own Bible?” I asked. Surprised, she answered, “Yes!” And then I gave her a Bible in her own language.<\/p><p>Later that night, I left the room and when I returned, she wasn’t there. The Bible wasn’t there either. I was so worried. After a few minutes, Mariam appeared and told me that she showed the Bible to her parents. Now I was really worried and thought to myself, I won’t be sleeping in this house tonight! It’s typically not safe to share Bibles here.<\/p><p>To my relief, she told me that they were happy for her and thankful for the gift. I was overjoyed, and I praised God silently. What an incredible miracle!<\/p><p>*Names have been changed.<\/p><hr><p><em><\/em><\/p><p><em>The Waldensian Student initiative is a frontline mission approach in which Seventh-day Adventist students live, study, and serve in secular <\/em><em>universities in veiled countries.<\/em><\/p><div><\/div>","post_title":"Juliana’s Incredible Miracle","post_excerpt":"When I found out that I’d be a Waldensian student in a veiled country, I prayed for my future classmates.","post_type":"post","post_name":"julianas-incredible-miracle","post_modified":"2020-10-29 11:59:32","post_modified_gmt":"2020-10-29 15:59:32","post_parent":6787,"menu_order":32,"meta_input":{"_featured_image_hero_layout":"hero_layout_1_3","_display_title":"Juliana’s Incredible Miracle","_kicker":"","_long_header_subtitle":"When I found out that I’d be a Waldensian student in a veiled country, I prayed for my future classmates.","_hero_type":"default","_hero_title":"Juliana’s Incredible Miracle","_hero_kicker":""},"tags":["Global Mission","Picture Story","Missionary"]}},"7060":{"media":{"featuredImage":{"file":"https:\/\/gm.adventistmission.org\/assets\/public\/gm\/picture-story\/2021\/v21n1\/ps21q1-4-banner.jpg","desc":""}},"post":{"post_status":"publish","comment_status":"closed","post_date":"2021-02-16 17:59:00","post_date_gmt":"2021-02-16 22:59:00","post_content":"<p><span class=\"s1\" style=\"background-color: initial;\">Dear Friend,<\/span><\/p><p><span class=\"s1\" style=\"background-color: initial;\">D<\/span>id you know that all of the world’s five largest urban areas are in the 10\/40 Window? The Tokyo, Guangzhou, Shanghai, Jakarta, and Delhi agglomerations are so large that it would take the combined population of 33 of the largest agglomerations in the U.S. and Canada to equal these four cities! (An agglomeration is a contiguous urbanized region.)<\/p><p>In fact, greater Tokyo alone is so large that there are 88 countries whose populations combined would not be larger than that city! <\/p><p><span><\/span>How unreached is the 10\/40 Window? Prior to the pandemic, there were more Adventists worshipping at the Loma Linda University church each week than Adventists in all of the Middle East and North Africa. While two-thirds of the world’s population lives in the 10\/40 Window, only 15% of Adventist churches are there. And 84% of the world’s 7,414 unreached people groups live in the 10\/40 Window.<\/p><p>This is why Global Mission is so focused on planting churches, sending Global Mission pioneers, and establishing Urban Centers of Influence in this region of the world where so few people know about a loving Savior. And this is why we are so grateful for your support of Global Mission!<\/p><p><em><\/em><\/p><div><\/div>","post_title":"The Unreached Need Your Help!","post_excerpt":"They remembered this as they walked miles to the homes of neighbors and other community members.","post_type":"post","post_name":"the-unreached-need-your-help!","post_modified":"2022-01-24 17:47:20","post_modified_gmt":"2022-01-24 22:47:20","post_parent":6787,"menu_order":31,"meta_input":{"_featured_image_hero_layout":"hero_layout_1_3","_display_title":"The Unreached Need Your Help!","_kicker":"","_long_header_subtitle":"They remembered this as they walked miles to the homes of neighbors and other community members.","_hero_type":"default","_hero_title":"The Unreached Need Your Help!","_hero_kicker":""},"tags":["Global Mission","Picture Story","Missionary"]}},"7117":{"media":{"featuredImage":{"file":"https:\/\/gm.adventistmission.org\/assets\/public\/gm\/picture-story\/2021\/v21n2\/p21q2-2-banner.jpg","desc":""}},"post":{"post_status":"publish","comment_status":"closed","post_date":"2021-04-29 06:00:00","post_date_gmt":"2021-04-29 10:00:00","post_content":"<p>There’s more than one way to plant a church, especially in the modern era. You can even start with social media if you’re brave enough. In the Philippines, Reylourd Reyes had the idea to use meetup phone apps to connect young people.\r\n<\/p><p>He created his own group called CAFÉ Life. CAFÉ stands for Community, Authenticity, Friendship, and Experience. “It’s a small group idea,” he says, “to open an avenue for young professionals to connect and hang out after work.” This is how the church plant started.\r\n<\/p><p>With the initial small group that met up regularly, they were able to branch out into a new demographic, mostly unchurched and secular young people. The team decided to even create their own phone app for CAFÉ Life to help start more small groups throughout the Philippines.\r\n<\/p><p>Reylourd says that his church is utilizing social media to connect with a lot of people. The small groups also meet virtually through video meetups, and they’re always meeting new people through social media. Please pray for this ministry and church planting effort.\r\n<\/p>","post_title":"CAFÉ Life App","post_excerpt":"“It’s a small group idea,” he says, “to open an avenue for young professionals to connect and hang out after work.” ","post_type":"post","post_name":"cafe-life-app","post_modified":"2021-04-29 11:40:12","post_modified_gmt":"2021-04-29 15:40:12","post_parent":6787,"menu_order":22,"meta_input":{"_featured_image_hero_layout":"hero_layout_1_3","_display_title":"CAFÉ Life App","_kicker":"","_long_header_subtitle":"“It’s a small group idea,” he says, “to open an avenue for young professionals to connect and hang out after work.” ","_hero_type":"default","_hero_title":"CAFÉ Life App","_hero_kicker":""},"tags":["Global Mission","Picture Story","Missionary"]}}}